
#Списки: Срезы

#lst = ["Москва", "Санкт-Петербург", "Тверь", "Казань"]
#lst2 = lst[:-1:2]
#print(lst)
#print(lst2)

#lst = ["Москва", "Санкт-Петербург", "Тверь", "Казань"]
#lst[1:3] = "Владимир", "Астрахань"
#lst2 = lst[1:3] = "Владимир", "Астрахань"
#print(lst)
#print(lst2)

#Удаление элементов списка
#a = [1, -54, 3, 23, 43, -45, 0]
#End = a.pop(3)
#print(End)
#Копирование элементов списка
#a = [1, -54, 3, 23, 43, -45, 0]
#c = a.copy()
#print(c)

#Задания

#Задание №1
lst = []
while True:
    n = int(input("Введите число: "))
    if n!=0:
        lst.append(n**2)
    else:break
    print(lst)
    
#Задание №2

    
#Задание №3
#Задание №4    
    
    
