
#Списки: Срезы

#lst = ["Москва", "Санкт-Петербург", "Тверь", "Казань"]
#lst2 = lst[:-1:2]
#print(lst)
#print(lst2)

#lst = ["Москва", "Санкт-Петербург", "Тверь", "Казань"]
#lst[1:3] = "Владимир", "Астрахань"
#lst2 = lst[1:3] = "Владимир", "Астрахань"
#print(lst)
#print(lst2)

#Удаление элементов списка
#a = [1, -54, 3, 23, 43, -45, 0]
#End = a.pop(3)
#print(End)
#Копирование элементов списка
#a = [1, -54, 3, 23, 43, -45, 0]
#c = a.copy()
#print(c)

#Задания

#Задание №1
#lst = []
#while True:
    #n = int(input("Введите число: "))
    #if n!=0:
        #lst.append(n**2)
    #else:break
    #print(lst)
    
#Задание №2

#print([x for x in['+7912123456', '915213456', '+6915213456', '+4915213456', '+7915213456'] if '+7' not in x])

#Задание №3
x = [1,2,3,4,5,6]
lst_x = [x[i] for i in range(1, len(x))]
lst_x.append(x[0])
print(lst_x)

#Задание №4
x = [1,2,3,4,5,6]
lst_x = []
for i in x:
    lst_x.append(i-1)
lst_x[0] = x[-1]
print(lst_x)

    
    
