# Операнд - то к чему применяется оператор  5 * 2
# Унарным называется оператор, который применяется к одному операнду
# Унарный минус
#a=1; a=-a
#print(a)
# Бинарным называется оператор, который применяется к двум операндам
#a = 1; b = 2
#бинарный минус
#c = b-a
#print(c)
#a = 1; b = 2
#c = b+a
#print(c)
#a=2; b=-5.8; c=2.3
#print( a+b*c )

#a=2; b=-5.8; c=2.3
#print( (a+b)*c )

#/ - Вещественное деление
#// - Целочисленное деление
# 7 % 5 - 
# операторы *,/,//,% имеют одинаковый приоритет и выполняется слева-направо
#x=2; y=5;
#print(x**y)

#x=1.96; y=0.5;
#print(x**y)

#i = 5; j = 3
#i += 1 # i=i+1
#j -= 2 # J=J-2
#print(i, j)

#i *= 3 # i=i*3
#j /= 4 # j=j/4
#print(i, j)

#a = 5; b = 10
#a **= 2
#b //= 3
#print(a, b)

#a = 1 + 2j
#b = 2 - 3j
#print(a+b)
#print(a-b)
#print(a*b)
#print(a/b)
#print(a**b)

#a = 1 + 2j
#b = 2 - 3j
#print(a.real)
#print(b.imag)

#sa = a.conjugate();
#print(sa)

# abs(x) - вычисляет модуль числа x
# round(x) - округляет х до ближайшего целого
# min(x1,x2,...,x_n) - находит минимальное, СРЕДИ УКАЗАННЫХ ЧИСЕЛ 
# max(x1,x2,...,x_n) - находит максимальное, среди указанных чисел
# pow(x,y) - возводит х в степень у
#import math

#import math
#a = 2.4
#b = math.cos(a)
#print(b)
#print(math.floor(1.7) )
#print(math.ceil(1.7) )
#print(math.sqrt(2.56) )










