#Первый пример

#psw = "pass"
#in_psw = ""
#while psw != in_psw:
    #in_psw = input("Введите пароль: ")
#print("Вход в систему разрешен")

#Задания к уроку


#Задача №3 (Полиндром или нет) 
#str=input("Enter word: "); z=len(str)
#if  str[0::1]==str[z::-1]:
    #print("yes")
#else:
      #print("no")

#Задание 2) a = "abracadabra"  удалить все сочитания ab
a = "abracadabra"
b = a.count('ab')
print(a.replace("ab","",b))

